### Join Merge Concatenation in Pandas

In [4]:
import pandas as pd
df1 = pd.DataFrame({'val': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'num': range(7)})
df1

  val  num
0   b    0
1   b    1
2   a    2
3   c    3
4   a    4
5   a    5
6   b    6

In [39]:
df2 = pd.DataFrame({'val': ['b', 'a']})
df2

  val
0   b
1   a

In [6]:
pd.concat([df1,df2])

/home/kakashi/WorkSpace/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   num val
0  0.0   b
1  1.0   b
2  2.0   a
3  3.0   c
4  4.0   a
5  5.0   a
6  6.0   b
0  NaN   b
1  NaN   a

In [7]:
pd.merge(df1,df2)

  val  num
0   b    0
1   b    1
2   b    6
3   a    2
4   a    4
5   a    5

In [10]:
df1.join(df2.set_index('val'))

  val  num
0   b    0
1   b    1
2   a    2
3   c    3
4   a    4
5   a    5
6   b    6

In [15]:
df1.join(df2.set_index('val'))

  val  num  num2
0   b    0   NaN
1   b    1   NaN
2   a    2   NaN
3   c    3   NaN
4   a    4   NaN
5   a    5   NaN
6   b    6   NaN

In [16]:
pd.merge(df1,df2)

  val  num  num2
0   b    0   123
1   b    1   123
2   b    6   123
3   a    2   456
4   a    4   456
5   a    5   456

In [17]:
pd.concat([df1,df2])

/home/kakashi/WorkSpace/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   num   num2 val
0  0.0    NaN   b
1  1.0    NaN   b
2  2.0    NaN   a
3  3.0    NaN   c
4  4.0    NaN   a
5  5.0    NaN   a
6  6.0    NaN   b
0  NaN  123.0   b
1  NaN  456.0   a

     val  num2
num2
123    b   123
456    a   456

In [42]:
df1.join(df2,how='left', lsuffix='_left', rsuffix='_right')

  val_left  num val_right  num2
0        b    0         b  12.0
1        b    1         a  34.0
2        a    2       NaN   NaN
3        c    3       NaN   NaN
4        a    4       NaN   NaN
5        a    5       NaN   NaN
6        b    6       NaN   NaN

In [41]:
df2['num2'] = [12,34]
df2

  val  num2
0   b    12
1   a    34